<<HW2-READ ME>>
------------------------------------
*****讀檔*****

程式碼如下:
ifstream infile;
infile.open("Case1.txt");

讀入一個檔名為 Case1.txt 的檔案
若讀進的檔案為下:
7
1 0 1 1 0 1 1 0 0 1 1 0 1 1 1 1
2 1 1 2 0 2 1 0 0 0 1 0 0 0 1 0
0 0 0 0 1 0 0 0 1 0 1 2 1 2 1 1
1 2 0 0 1 2 0 0 1 2 0 0 1 2 0 0
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 0 0 0 0 1 0 0 0 0 1 0 0 0 0 1
0 0 0 0 0 1 0 0 0 0 1 1 0 0 1 1

第一行為測資數量
接下來每一行為一筆測資
每個數字只能為0 或 1 或 2
------------------------------------

------------------------------------
*****寫檔*****

程式碼如下:
fstream file;
file.open("text.txt", ios::out);

會將答案要寫入檔名為 text.txt 的檔案
寫進的檔案為下:
#1
2121
2020
2012
1022
#2
2211
0022
#3
2100
1212
1022
#4
2202
#5
2222
#6
1111
1010
0101
0000
#7
1212
0101
#8
2221
2122

#後面的數字為第幾筆測資
接下來每一行為一個SOP
2: don't care 1: one 0: zero